nrfconnect/sdk-nrf/drivers/wifi/nrf71/inc/system/main.h
/*
 * Copyright (c) 2024 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: Apache-2.0
 */

/**
 * @brief Header containing system mode specific declarations
 */

#ifndef __SYSTEM_MAIN_H__
#define __SYSTEM_MAIN_H__

#include <stdio.h>

#include <zephyr/version.h>

#include <zephyr/kernel.h>
#include <zephyr/net/net_if.h>
#include <zephyr/net/wifi_mgmt.h>
#include <zephyr/net/ethernet.h>

#ifdef CONFIG_NETWORKING
#include <system/net_if.h>
#endif /* CONFIG_NETWORKING */

#ifdef CONFIG_NRF71_STA_MODE
#include <drivers/driver_zephyr.h>
#endif /* CONFIG_NRF71_STA_MODE */

#include <system/fmac_api.h>
#include <nrf71_wifi_ctrl.h>
#include <common/rf_params.h>

#define NRF71_DRIVER_VERSION "1."KERNEL_VERSION_STRING

/* Calculate compile-time maximum for vendor stats */
#ifdef CONFIG_NET_STATISTICS_ETHERNET_VENDOR
#define MAX_VENDOR_STATS ((sizeof(struct rpu_sys_fw_stats) / sizeof(uint32_t)) + 1)
#endif /* CONFIG_NET_STATISTICS_ETHERNET_VENDOR */

struct nrf_wifi_vif_ctx_zep {
	const struct device *zep_dev_ctx;
	struct net_if *zep_net_if_ctx;
	void *supp_drv_if_ctx;
	void *rpu_ctx_zep;
	unsigned char vif_idx;
	struct k_mutex vif_lock;

	scan_result_cb_t disp_scan_cb;
	bool scan_in_progress;
	int scan_type;
	uint16_t max_bss_cnt;
	unsigned int scan_res_cnt;
	struct k_work_delayable scan_timeout_work;
	struct k_work disp_scan_res_work;

	struct net_eth_addr mac_addr;
	int if_type;
	char ifname[16];
	enum nrf_wifi_fmac_if_op_state if_op_state;
	bool set_if_event_received;
	int set_if_status;
#ifdef CONFIG_NET_L2_WIFI_MGMT
	struct nrf_wifi_umac_event_scan_done scan_done_event;
#endif /* CONFIG_NET_L2_WIFI_MGMT */
#ifdef CONFIG_NET_STATISTICS_ETHERNET
#ifdef CONFIG_NET_STATISTICS_ETHERNET_VENDOR
	struct net_stats_eth_vendor eth_stats_vendor_data[MAX_VENDOR_STATS];
	char vendor_key_strings[MAX_VENDOR_STATS][16];
#endif /* CONFIG_NET_STATISTICS_ETHERNET_VENDOR */
	struct net_stats_eth eth_stats;
#endif /* CONFIG_NET_STATISTICS_ETHERNET */
#if defined(CONFIG_NRF71_STA_MODE) || defined(CONFIG_NRF71_RAW_DATA_TX)
	bool authorized;
#endif
#ifdef CONFIG_NRF71_RAW_DATA_TX
	/** Last base mode from WiFi mgmt set_mode (e.g. MONITOR/STA). Used when
	 *  building combined mode for TX injection so we send the intended base
	 *  even before the async mode event has been applied.
	 */
	unsigned char requested_wifi_mode;
#endif
#ifdef CONFIG_NRF71_STA_MODE
	unsigned int assoc_freq;
	enum nrf_wifi_fmac_if_carr_state if_carr_state;
	struct wpa_signal_info *signal_info;
	struct wpa_conn_info *conn_info;
	struct zep_wpa_supp_dev_callbk_fns supp_callbk_fns;
	unsigned char twt_flows_map;
	unsigned char twt_flow_in_progress_map;
	struct wifi_ps_config *ps_info;
	bool ps_config_info_evnt;
	bool cookie_resp_received;
#ifdef CONFIG_NRF71_DATA_TX
	struct k_work nrf_wifi_net_iface_work;
#endif /* CONFIG_NRF71_DATA_TX */
	unsigned long rssi_record_timestamp_us;
	signed short rssi;
#ifdef CONFIG_NRF_WIFI_CONNECT_SCAN_RESULTS_GDRAM
	/* Connect scan results database cached from the scan done event, read
	 * on the supplicant's get scan results call and freed right after.
	 */
	unsigned int connect_scan_db_addr;
	unsigned int connect_scan_res_cnt;
#endif /* CONFIG_NRF_WIFI_CONNECT_SCAN_RESULTS_GDRAM */
#endif /* CONFIG_NRF71_STA_MODE */
#ifdef CONFIG_NRF71_AP_MODE
	int inactive_time_sec;
#endif /* CONFIG_NRF71_AP_MODE */
#ifdef CONFIG_NRF_WIFI_RPU_RECOVERY
	struct k_work nrf_wifi_rpu_recovery_work;
	struct k_work_delayable nrf_wifi_rpu_recovery_bringup_work;
#endif /* CONFIG_NRF_WIFI_RPU_RECOVERY */
	int rts_threshold_value;
	unsigned short bss_max_idle_period;
};

struct nrf_wifi_vif_ctx_map {
	const char *ifname;
	struct nrf_wifi_vif_ctx_zep *vif_ctx;
};

struct nrf_wifi_ctx_zep {
	void *drv_priv_zep;
	void *rpu_ctx;
	struct nrf_wifi_vif_ctx_zep vif_ctx_zep[MAX_NUM_VIFS];
#ifdef CONFIG_NRF71_UTIL
	struct rpu_conf_params conf_params;
#endif /* CONFIG_NRF71_UTIL */
	unsigned char *extended_capa, *extended_capa_mask;
	unsigned int extended_capa_len;
	struct k_mutex rpu_lock;
#ifdef CONFIG_NRF_WIFI_RPU_RECOVERY
	bool rpu_recovery_in_progress;
	unsigned long last_rpu_recovery_time_ms;
	unsigned int rpu_recovery_retries;
	int rpu_recovery_success;
	int rpu_recovery_failure;
	int wdt_irq_received;
	int wdt_irq_ignored;
#endif /* CONFIG_NRF_WIFI_RPU_RECOVERY */
	unsigned int phy_rf_params_addr[NUM_RF_PARAM_ADDRS];
	unsigned int vtf_buffer_start_address;
#if defined(CONFIG_NRF71_RAW_DATA_TX) || defined(CONFIG_NRF71_RAW_DATA_RX)
	struct k_sem channel_set_done_sem;
	volatile int channel_set_status;
#endif
};

struct nrf_wifi_drv_priv_zep {
	struct nrf_wifi_fmac_priv *fmac_priv;
	struct nrf_wifi_ctx_zep rpu_ctx_zep;
};

extern struct nrf_wifi_drv_priv_zep rpu_drv_priv_zep;

#ifdef CONFIG_NRF_WIFI_RPU_RECOVERY
void nrf_wifi_rpu_recovery_cb(void *vif_ctx,
		void *event_data,
		unsigned int event_len);
#endif /* CONFIG_NRF_WIFI_RPU_RECOVERY */

enum nrf_wifi_status nrf_wifi_sys_fmac_dev_add_zep(struct nrf_wifi_drv_priv_zep *drv_priv_zep);
enum nrf_wifi_status nrf_wifi_sys_fmac_dev_rem_zep(struct nrf_wifi_drv_priv_zep *drv_priv_zep);
#endif /* __SYSTEM_MAIN_H__ */
